app/controllers/visitors_controller.rb

INSERT INTO "visitors" ("company", "created_at", "email", "position", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["company", "meowzerlazer"], ["created_at", "2014-06-29 01:47:50.784637"], ["email", "sicombo12@gmail.com"], ["position", "project manager"], ["updated_at", "2014-06-29 01:47:50.784637"]]
---
def create
  Visitor.create(email: params[:email], position: params[:position], company: params[:company])